7767517
190 206
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=192 9=1
Permute                  permute_155              1 1 1 2 0=1
Convolution              convrelu_1               1 1 2 3 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Convolution              convrelu_2               1 1 3 4 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Convolution              convrelu_3               1 1 4 5 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_0              1 2 5 6 7
Reshape                  reshape_157              1 1 7 8 0=2048 1=12288
Gemm                     gemm_0                   1 1 8 9 10=-1 2=0 3=1 4=0 5=1 6=1 7=12288 8=256 9=2048
Reshape                  reshape_158              1 1 9 10 0=256 1=256 2=48
BatchNorm                bn_22                    1 1 10 11 0=48 1=1.000000e-05
ReLU                     relu_93                  1 1 11 12
Reshape                  reshape_159              1 1 12 13 0=256 1=12288
Gemm                     gemm_1                   1 1 13 14 10=-1 2=0 3=1 4=0 5=1 6=1 7=12288 8=2048 9=256
Reshape                  reshape_160              1 1 14 15 0=2048 1=256 2=48
BatchNorm                bn_23                    1 1 15 16 0=48 1=1.000000e-05
ReLU                     relu_94                  1 1 16 17
BinaryOp                 add_0                    2 1 6 17 18 0=0
Split                    splitncnn_1              1 2 18 19 20
Convolution              convrelu_4               1 1 20 21 0=96 1=2 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=18432 9=1
Convolution              convrelu_5               1 1 21 22 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Convolution              convrelu_6               1 1 22 23 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Convolution              convrelu_7               1 1 23 24 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_2              1 2 24 25 26
Reshape                  reshape_161              1 1 26 27 0=1024 1=12288
Gemm                     gemm_2                   1 1 27 28 10=-1 2=0 3=1 4=0 5=1 6=1 7=12288 8=128 9=1024
Reshape                  reshape_162              1 1 28 29 0=128 1=128 2=96
BatchNorm                bn_24                    1 1 29 30 0=96 1=1.000000e-05
ReLU                     relu_99                  1 1 30 31
Reshape                  reshape_163              1 1 31 32 0=128 1=12288
Gemm                     gemm_3                   1 1 32 33 10=-1 2=0 3=1 4=0 5=1 6=1 7=12288 8=1024 9=128
Reshape                  reshape_164              1 1 33 34 0=1024 1=128 2=96
BatchNorm                bn_25                    1 1 34 35 0=96 1=1.000000e-05
ReLU                     relu_100                 1 1 35 36
BinaryOp                 add_1                    2 1 25 36 37 0=0
Split                    splitncnn_3              1 2 37 38 39
Convolution              convrelu_8               1 1 39 40 0=144 1=2 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=55296 9=1
Convolution              convrelu_9               1 1 40 41 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=186624 9=1
Convolution              convrelu_10              1 1 41 42 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=186624 9=1
Convolution              convrelu_11              1 1 42 43 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=186624 9=1
Split                    splitncnn_4              1 2 43 44 45
Reshape                  reshape_165              1 1 45 46 0=512 1=9216
Gemm                     gemm_4                   1 1 46 47 10=-1 2=0 3=1 4=0 5=1 6=1 7=9216 8=64 9=512
Reshape                  reshape_166              1 1 47 48 0=64 1=64 2=144
BatchNorm                bn_26                    1 1 48 49 0=144 1=1.000000e-05
ReLU                     relu_105                 1 1 49 50
Reshape                  reshape_167              1 1 50 51 0=64 1=9216
Gemm                     gemm_5                   1 1 51 52 10=-1 2=0 3=1 4=0 5=1 6=1 7=9216 8=512 9=64
Reshape                  reshape_168              1 1 52 53 0=512 1=64 2=144
BatchNorm                bn_27                    1 1 53 54 0=144 1=1.000000e-05
ReLU                     relu_106                 1 1 54 55
BinaryOp                 add_2                    2 1 44 55 56 0=0
Split                    splitncnn_5              1 2 56 57 58
Convolution              convrelu_12              1 1 58 59 0=192 1=2 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=110592 9=1
Convolution              convrelu_13              1 1 59 60 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776 9=1
Convolution              convrelu_14              1 1 60 61 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776 9=1
Convolution              convrelu_15              1 1 61 62 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776 9=1
Split                    splitncnn_6              1 2 62 63 64
Reshape                  reshape_169              1 1 64 65 0=256 1=6144
Gemm                     gemm_6                   1 1 65 66 10=-1 2=0 3=1 4=0 5=1 6=1 7=6144 8=32 9=256
Reshape                  reshape_170              1 1 66 67 0=32 1=32 2=192
BatchNorm                bn_28                    1 1 67 68 0=192 1=1.000000e-05
ReLU                     relu_111                 1 1 68 69
Reshape                  reshape_171              1 1 69 70 0=32 1=6144
Gemm                     gemm_7                   1 1 70 71 10=-1 2=0 3=1 4=0 5=1 6=1 7=6144 8=256 9=32
Reshape                  reshape_172              1 1 71 72 0=256 1=32 2=192
BatchNorm                bn_29                    1 1 72 73 0=192 1=1.000000e-05
ReLU                     relu_112                 1 1 73 74
BinaryOp                 add_3                    2 1 63 74 75 0=0
Split                    splitncnn_7              1 2 75 76 77
Convolution              convrelu_16              1 1 77 78 0=240 1=2 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=184320 9=1
Convolution              convrelu_17              1 1 78 79 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Convolution              convrelu_18              1 1 79 80 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Convolution              convrelu_19              1 1 80 81 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Split                    splitncnn_8              1 2 81 82 83
Reshape                  reshape_173              1 1 83 84 0=128 1=3840
Gemm                     gemm_8                   1 1 84 85 10=-1 2=0 3=1 4=0 5=1 6=1 7=3840 8=16 9=128
Reshape                  reshape_174              1 1 85 86 0=16 1=16 2=240
BatchNorm                bn_30                    1 1 86 87 0=240 1=1.000000e-05
ReLU                     relu_117                 1 1 87 88
Reshape                  reshape_175              1 1 88 89 0=16 1=3840
Gemm                     gemm_9                   1 1 89 90 10=-1 2=0 3=1 4=0 5=1 6=1 7=3840 8=128 9=16
Reshape                  reshape_176              1 1 90 91 0=128 1=16 2=240
BatchNorm                bn_31                    1 1 91 92 0=240 1=1.000000e-05
ReLU                     relu_118                 1 1 92 93
BinaryOp                 add_4                    2 1 82 93 94 0=0
Split                    splitncnn_9              1 2 94 95 96
Convolution              convrelu_20              1 1 96 97 0=288 1=2 11=2 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=276480 9=1
Convolution              convrelu_21              1 1 97 98 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496 9=1
Convolution              convrelu_22              1 1 98 99 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496 9=1
Convolution              convrelu_23              1 1 99 100 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=746496 9=1
Split                    splitncnn_10             1 2 100 101 102
Reshape                  reshape_177              1 1 102 103 0=64 1=2304
Gemm                     gemm_10                  1 1 103 104 10=-1 2=0 3=1 4=0 5=1 6=1 7=2304 8=8 9=64
Reshape                  reshape_178              1 1 104 105 0=8 1=8 2=288
BatchNorm                bn_32                    1 1 105 106 0=288 1=1.000000e-05
ReLU                     relu_123                 1 1 106 107
Reshape                  reshape_179              1 1 107 108 0=8 1=2304
Gemm                     gemm_11                  1 1 108 109 10=-1 2=0 3=1 4=0 5=1 6=1 7=2304 8=64 9=8
Reshape                  reshape_180              1 1 109 110 0=64 1=8 2=288
BatchNorm                bn_33                    1 1 110 111 0=288 1=1.000000e-05
ReLU                     relu_124                 1 1 111 112
BinaryOp                 add_5                    2 1 101 112 113 0=0
Deconvolution            deconvrelu_0             1 1 113 114 0=240 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=276480 9=1
BinaryOp                 mul_6                    2 1 114 95 115 0=2
Convolution              convrelu_24              1 1 115 116 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Convolution              convrelu_25              1 1 116 117 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Convolution              convrelu_26              1 1 117 118 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=518400 9=1
Split                    splitncnn_11             1 2 118 119 120
Reshape                  reshape_181              1 1 120 121 0=128 1=3840
Gemm                     gemm_12                  1 1 121 122 10=-1 2=0 3=1 4=0 5=1 6=1 7=3840 8=16 9=128
Reshape                  reshape_182              1 1 122 123 0=16 1=16 2=240
BatchNorm                bn_34                    1 1 123 124 0=240 1=1.000000e-05
ReLU                     relu_129                 1 1 124 125
Reshape                  reshape_183              1 1 125 126 0=16 1=3840
Gemm                     gemm_13                  1 1 126 127 10=-1 2=0 3=1 4=0 5=1 6=1 7=3840 8=128 9=16
Reshape                  reshape_184              1 1 127 128 0=128 1=16 2=240
BatchNorm                bn_35                    1 1 128 129 0=240 1=1.000000e-05
ReLU                     relu_130                 1 1 129 130
BinaryOp                 add_7                    2 1 119 130 131 0=0
Deconvolution            deconvrelu_1             1 1 131 132 0=192 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=184320 9=1
BinaryOp                 mul_8                    2 1 132 76 133 0=2
Convolution              convrelu_27              1 1 133 134 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776 9=1
Convolution              convrelu_28              1 1 134 135 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776 9=1
Convolution              convrelu_29              1 1 135 136 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776 9=1
Split                    splitncnn_12             1 2 136 137 138
Reshape                  reshape_185              1 1 138 139 0=256 1=6144
Gemm                     gemm_14                  1 1 139 140 10=-1 2=0 3=1 4=0 5=1 6=1 7=6144 8=32 9=256
Reshape                  reshape_186              1 1 140 141 0=32 1=32 2=192
BatchNorm                bn_36                    1 1 141 142 0=192 1=1.000000e-05
ReLU                     relu_135                 1 1 142 143
Reshape                  reshape_187              1 1 143 144 0=32 1=6144
Gemm                     gemm_15                  1 1 144 145 10=-1 2=0 3=1 4=0 5=1 6=1 7=6144 8=256 9=32
Reshape                  reshape_188              1 1 145 146 0=256 1=32 2=192
BatchNorm                bn_37                    1 1 146 147 0=192 1=1.000000e-05
ReLU                     relu_136                 1 1 147 148
BinaryOp                 add_9                    2 1 137 148 149 0=0
Deconvolution            deconvrelu_2             1 1 149 150 0=144 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=110592 9=1
BinaryOp                 mul_10                   2 1 150 57 151 0=2
Convolution              convrelu_30              1 1 151 152 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=186624 9=1
Convolution              convrelu_31              1 1 152 153 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=186624 9=1
Convolution              convrelu_32              1 1 153 154 0=144 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=186624 9=1
Split                    splitncnn_13             1 2 154 155 156
Reshape                  reshape_189              1 1 156 157 0=512 1=9216
Gemm                     gemm_16                  1 1 157 158 10=-1 2=0 3=1 4=0 5=1 6=1 7=9216 8=64 9=512
Reshape                  reshape_190              1 1 158 159 0=64 1=64 2=144
BatchNorm                bn_38                    1 1 159 160 0=144 1=1.000000e-05
ReLU                     relu_141                 1 1 160 161
Reshape                  reshape_191              1 1 161 162 0=64 1=9216
Gemm                     gemm_17                  1 1 162 163 10=-1 2=0 3=1 4=0 5=1 6=1 7=9216 8=512 9=64
Reshape                  reshape_192              1 1 163 164 0=512 1=64 2=144
BatchNorm                bn_39                    1 1 164 165 0=144 1=1.000000e-05
ReLU                     relu_142                 1 1 165 166
BinaryOp                 add_11                   2 1 155 166 167 0=0
Deconvolution            deconvrelu_3             1 1 167 168 0=96 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=55296 9=1
BinaryOp                 mul_12                   2 1 168 38 169 0=2
Convolution              convrelu_33              1 1 169 170 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Convolution              convrelu_34              1 1 170 171 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Convolution              convrelu_35              1 1 171 172 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944 9=1
Split                    splitncnn_14             1 2 172 173 174
Reshape                  reshape_193              1 1 174 175 0=1024 1=12288
Gemm                     gemm_18                  1 1 175 176 10=-1 2=0 3=1 4=0 5=1 6=1 7=12288 8=128 9=1024
Reshape                  reshape_194              1 1 176 177 0=128 1=128 2=96
BatchNorm                bn_40                    1 1 177 178 0=96 1=1.000000e-05
ReLU                     relu_147                 1 1 178 179
Reshape                  reshape_195              1 1 179 180 0=128 1=12288
Gemm                     gemm_19                  1 1 180 181 10=-1 2=0 3=1 4=0 5=1 6=1 7=12288 8=1024 9=128
Reshape                  reshape_196              1 1 181 182 0=1024 1=128 2=96
BatchNorm                bn_41                    1 1 182 183 0=96 1=1.000000e-05
ReLU                     relu_148                 1 1 183 184
BinaryOp                 add_13                   2 1 173 184 185 0=0
Deconvolution            deconvrelu_4             1 1 185 186 0=48 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=18432 9=1
BinaryOp                 mul_14                   2 1 186 19 187 0=2
Convolution              convrelu_36              1 1 187 188 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Convolution              convrelu_37              1 1 188 189 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Convolution              convrelu_38              1 1 189 190 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Split                    splitncnn_15             1 2 190 191 192
Reshape                  reshape_197              1 1 192 193 0=2048 1=12288
Gemm                     gemm_20                  1 1 193 194 10=-1 2=0 3=1 4=0 5=1 6=1 7=12288 8=256 9=2048
Reshape                  reshape_198              1 1 194 195 0=256 1=256 2=48
BatchNorm                bn_42                    1 1 195 196 0=48 1=1.000000e-05
ReLU                     relu_153                 1 1 196 197
Reshape                  reshape_199              1 1 197 198 0=256 1=12288
Gemm                     gemm_21                  1 1 198 199 10=-1 2=0 3=1 4=0 5=1 6=1 7=12288 8=2048 9=256
Reshape                  reshape_200              1 1 199 200 0=2048 1=256 2=48
BatchNorm                bn_43                    1 1 200 201 0=48 1=1.000000e-05
ReLU                     relu_154                 1 1 201 202
BinaryOp                 add_15                   2 1 191 202 203 0=0
Permute                  permute_156              1 1 203 204 0=1
Convolution              conv_83                  1 1 204 out0 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=192
